app/controllers/carts_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1 AND "cart_items"."product_id" = 2 LIMIT 1
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2025-06-28 17:05:12.957832' WHERE "cart_items"."id" = 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 2)
---
  def add_item
    @products = Product.all
    if request.post?
      product = Product.find(params[:product_id])
      quantity = params[:quantity].to_i
      item = @cart.cart_items.find_or_initialize_by(product: product)
      if item.new_record?
        item.quantity = quantity
      else
        item.quantity += quantity
      end
      item.save!
      flash[:notice] = "Added #{quantity} #{product.name}(s) to cart."
      redirect_to add_item_cart_path(@cart)
    end
    @items = @cart.cart_items.includes(:product).to_a

SELECT "carts".* FROM "carts" WHERE "carts"."id" = 1 LIMIT 1
---
  def set_cart
    @cart = Cart.find(params[:id]) || Cart.create!